# [ 배재대학교 집중학기제 ]
### 20220511 (수)

In [1]:
import numpy as np
import pandas as pd

## [ Pandas ]

In [2]:
# DataFrame 만들어 보기

data = pd.DataFrame([['정광희', 99, "1999/1/1"],['박성현', 82, "1999/2/12"],['문준휘', 88, "2000/5/5"]], columns=['이름','성적','생일']) # columns을 안 붙이면 자동으로 만들어준다.
data

    이름  성적         생일
0  정광희  99   1999/1/1
1  박성현  82  1999/2/12
2  문준휘  88   2000/5/5

In [3]:
data.info() # 판다스 데이터프레임의 정보를 알려준다. ( 디비랑 방식이 비슷한 것 같다... )

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   성적      3 non-null      int64
 2   생일      3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [4]:
data.describe() # describe -> 묘사하다

              성적
count   3.000000
mean   89.666667
std     8.621678
min    82.000000
25%    85.000000
50%    88.000000
75%    93.500000
max    99.000000

In [5]:
data['이름'], data[['이름', '성적']] # 원하는 데이터만 뽑아내기

(0    정광희
 1    박성현
 2    문준휘
 Name: 이름, dtype: object,
     이름  성적
 0  정광희  99
 1  박성현  82
 2  문준휘  88)

In [6]:
data.이름 # 이렇게도 원하는 데이터를 뽑을 수 있다.

0    정광희
1    박성현
2    문준휘
Name: 이름, dtype: object

In [7]:
display(data[:2], data[:2]) # :2 -> 0 ~ 1까지, 0:2 = :2

    이름  성적         생일
0  정광희  99   1999/1/1
1  박성현  82  1999/2/12

    이름  성적         생일
0  정광희  99   1999/1/1
1  박성현  82  1999/2/12

In [8]:
# 원하는 값 추가 

data['loc'] = ['서울', '원주', '강릉']
data

    이름  성적         생일 loc
0  정광희  99   1999/1/1  서울
1  박성현  82  1999/2/12  원주
2  문준휘  88   2000/5/5  강릉

In [9]:
# 컬럼 수정

data.columns = ['name', 'score', 'birth', 'location']
data

  name  score      birth location
0  정광희     99   1999/1/1       서울
1  박성현     82  1999/2/12       원주
2  문준휘     88   2000/5/5       강릉

In [10]:
# 값 변경

data.birth = [19990101, 19890212, 20050505]
data

  name  score     birth location
0  정광희     99  19990101       서울
1  박성현     82  19890212       원주
2  문준휘     88  20050505       강릉

In [11]:
# numpy로 변환

data.values

array([['정광희', 99, 19990101, '서울'],
       ['박성현', 82, 19890212, '원주'],
       ['문준휘', 88, 20050505, '강릉']], dtype=object)

In [12]:
# 날자형으로 변환

pd.to_datetime(data.birth)

0   1970-01-01 00:00:00.019990101
1   1970-01-01 00:00:00.019890212
2   1970-01-01 00:00:00.020050505
Name: birth, dtype: datetime64[ns]

In [13]:
# 날자형으로 변환2
print(data.birth)
pd.to_datetime(data.birth, format='%Y%m%d')

0    19990101
1    19890212
2    20050505
Name: birth, dtype: int64

0   1999-01-01
1   1989-02-12
2   2005-05-05
Name: birth, dtype: datetime64[ns]

In [14]:
# 많이 사용되는 함수
# value().counts() --> 카운터
# sort_index(), sort_values() --> 정렬

data = pd.DataFrame([['에이군', '대전'], ['비군', '천안'], ['씨양', '세종'], ['디군', '대전']], columns=['이름', '지역'])
print(data.지역.value_counts())

print(data)
data.지역.sort_values()

대전    2
천안    1
세종    1
Name: 지역, dtype: int64
    이름  지역
0  에이군  대전
1   비군  천안
2   씨양  세종
3   디군  대전

0    대전
3    대전
2    세종
1    천안
Name: 지역, dtype: object